ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include <math.h>
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "arm_mve.h"
#include "stdio.h"
#include <stdint.h>
#include <string.h>
#include "xspi_nor.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "mx25um51245g.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define HPIX 640
#define VPIX 480
#define N (HPIX * VPIX)
#define SENSOR_WIDTH  HPIX
#define SENSOR_HEIGHT VPIX

// Planck constants
#define PLANCK_C1 1.191042e8f
#define PLANCK_C2 1.4387752e4f

// Temperature format
#define TEMP_SCALE 100.0f
#define TEMP_OFFSET 10000.0f

// Sensor parameters (ADJUST!)
#define SENSOR_WAVELENGTH 10.0f
#define ADC_TO_RADIANCE_SCALE 1e-11f
#define FLAG_TEMP_CELSIUS 25.0f

// LED1 Definition
#define LED1_Pin GPIO_PIN_8
#define LED1_GPIO_Port GPIOG
#define LED1_SET()    (GPIOG->BSRR = LED1_Pin)
#define LED1_RESET()  (GPIOG->BSRR = (LED1_Pin << 16))

#define CYCLES_TO_MS(cycles) ((cycles) / 600000)
#define CYCLES_TO_US(cycles) ((cycles) / 600)

#define XSPI1_MMAP_BASE   0x90000000UL
#define XSPI2_MMAP_BASE   0x70000000UL
#define XSPI_MMAP_SIZE    0x10000000UL  // 256 MB

#define TIM2_PRESCALER  9999
#define TIM2_PERIOD     799

// Forward declarations
extern TIM_HandleTypeDef htim2;

void thermal_vsync_init(void);
void thermal_vsync_start(void);
void thermal_frame_process(void);

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

UART_HandleTypeDef huart1;

XSPI_HandleTypeDef hxspi2;

/* USER CODE BEGIN PV */

// ═══════════════════════════════════════════════════════
// DTCM (128 KB) - Planck LUT
// ═══════════════════════════════════════════════════════

__attribute__((section(".dtcm")))
uint16_t planck_table[65536];  // 128 KB
//__attribute__((aligned(16), section(".axisram1")))
//uint16_t planck_table[65536];  // ← Move to AXISRAM! (128 KB)
// ═══════════════════════════════════════════════════════
// AXISRAM1 (1 MB) - Line processing buffers
// ═══════════════════════════════════════════════════════

__attribute__((aligned(16), section(".axisram1")))
uint16_t gain_line[HPIX];      // 1.3 KB

__attribute__((aligned(16), section(".axisram1")))
uint16_t dark_line[HPIX];      // 1.3 KB

__attribute__((aligned(16), section(".axisram1")))
uint16_t temp_line[HPIX];      // 1.3 KB

__attribute__((aligned(16), section(".axisram1")))
uint16_t line_output[HPIX];    // 1.3 KB

// Total in AXISRAM1: ~5 KB ✓

// ═══════════════════════════════════════════════════════
// Main RAM (2 MB) - Frame buffers (dual purpose!)
// ═══════════════════════════════════════════════════════

// Frame buffers for DCMIPP (noncacheable for DMA)
__attribute__((section(".noncacheable")))
uint16_t frame_buffer_A[VPIX][HPIX];  // 614 KB

__attribute__((section(".noncacheable")))
uint16_t frame_buffer_B[VPIX][HPIX];  // 614 KB

// Total: 1228 KB ✓ Fits perfectly!

// ═══════════════════════════════════════════════════════
// Aliases for Phase 1 Tests - Reuse frame buffers!
// ═══════════════════════════════════════════════════════

// Smart pointer aliasing - NO extra memory used!
#define src_u16   ((uint16_t*)frame_buffer_A)    // 614 KB
#define dst_u16   ((uint16_t*)frame_buffer_B)    // 614 KB
#define temp_u16  ((uint16_t*)frame_buffer_A)    // Alias (can share with src)

// Small gain array for full-frame benchmark (NOT frame-sized!)
__attribute__((aligned(16)))
uint16_t gain_u16[HPIX];  // Just 1.3 KB! (replicate for each line)

// Small offset array
__attribute__((aligned(16)))
uint16_t off_u16[HPIX];   // Just 1.3 KB!

// Legacy XSPI test buffers (small)
uint8_t aTxBuffer[BUFFERSIZE];
__IO uint8_t aRxBuffer[BUFFERSIZE];

uint32_t xspi_mmap_base = XSPI2_MMAP_BASE;



// Timer handle
TIM_HandleTypeDef htim2;

// Thermal pipeline variables
volatile uint32_t vsync_count = 0;
volatile uint32_t frames_processed = 0;
volatile uint8_t frame_ready = 0;

// XSPI Calibration Data Pointers
#define XSPI_BASE          0x70000000
#define XSPI_DARK_OFFSET   0x000000
#define XSPI_GAIN_OFFSET   0x096000
#define XSPI_OFFSET_OFFSET 0x12C000

volatile uint16_t (*xspi_dark)[HPIX]   = (void*)(XSPI_BASE + XSPI_DARK_OFFSET);
volatile uint16_t (*xspi_gain)[HPIX]   = (void*)(XSPI_BASE + XSPI_GAIN_OFFSET);
volatile uint16_t (*xspi_offset)[HPIX] = (void*)(XSPI_BASE + XSPI_OFFSET_OFFSET);

// DCMIPP variables
volatile uint8_t dcmipp_active_buffer = 0;
volatile uint8_t frame_ready_for_processing = 0;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_XSPI2_Init(void);
void generate_planck_lut(uint16_t *planck_table, float wavelength_um,
                         float radiance_scale, float flag_temp_c);
float decode_temperature(uint16_t value);
void init_planck_lut(void);


/* USER CODE BEGIN PFP */

static inline uint16_t gain_to_q15(float gain);
void process_mve(const uint16_t *src, const uint16_t *gain, uint16_t *dst, int n, int16_t offset);
void planck_lut_mve(const uint16_t *src, uint16_t *dst, int n);
//static void XSPI_WriteEnable(XSPI_HandleTypeDef *hxspi);
//static void XSPI_AutoPollingMemReady(XSPI_HandleTypeDef *hxspi);
static void XSPI_NOR_OctalDTRModeCfg(XSPI_HandleTypeDef *hxspi);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

#if !defined(TERMINAL_IO)
#if defined(__ICCARM__)
int iar_fputc(int ch);
#define PUTCHAR_PROTOTYPE int iar_fputc(int ch)
#elif defined ( __CC_ARM ) || defined(__ARMCC_VERSION)
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#elif defined(__GNUC__)
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#endif
#endif

void thermal_vsync_init(void) {
    TIM_ClockConfigTypeDef sClockSourceConfig = {0};
    TIM_MasterConfigTypeDef sMasterConfig = {0};

