ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
    // Enable TIM2 clock
    __HAL_RCC_TIM2_CLK_ENABLE();

    // Configure Timer2
    htim2.Instance = TIM2;
    htim2.Init.Prescaler = TIM2_PRESCALER;
    htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim2.Init.Period = TIM2_PERIOD;
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;

    if (HAL_TIM_Base_Init(&htim2) != HAL_OK) {
        printf("ERROR: Timer2 init failed!\n");
        Error_Handler();
    }

    // Clock source configuration
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK) {
        Error_Handler();
    }

    // Master configuration
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK) {
        Error_Handler();
    }

    // Enable Timer2 interrupt
    HAL_NVIC_SetPriority(TIM2_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);

    printf("✓ Timer2 initialized: 50 Hz VSYNC\n");
}

void thermal_vsync_start(void) {
    if (HAL_TIM_Base_Start_IT(&htim2) != HAL_OK) {
        printf("ERROR: Timer2 start failed!\n");
        Error_Handler();
    }
    printf("✓ Timer2 started\n");
}

void thermal_frame_process(void) {
    // Placeholder - will be filled later
    frames_processed++;

//    // Toggle LED to show activity
//    static uint8_t led_state = 0;
//    if (led_state) {
//        LED1_RESET();
//        led_state = 0;
//    } else {
//        LED1_SET();
//        led_state = 1;
//    }
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if (htim->Instance == TIM2) {
    vsync_count++;
    frame_ready = 1;

    // Process frame
    thermal_frame_process();
  }
}
/* USER CODE BEGIN 0 */
// ═══════════════════════════════════════════════════════════════════
// PLANCK LUT GENERATION - NO FLOAT PRINTF!
// ═══════════════════════════════════════════════════════════════════

void generate_planck_lut(
    uint16_t *planck_table,
    float wavelength_um,
    float radiance_scale,
    float flag_temp_c)
{
    printf("\n");
    printf("╔═══════════════════════════════════════════════╗\n");
    printf("║  Generating Planck LUT (0.01°C resolution)   ║\n");
    printf("╚═══════════════════════════════════════════════╝\n");
    printf("\n");

    printf("Parameters:\n");

    // Convert float to int for printing
    int wavelength_int = (int)wavelength_um;
    printf("  • Wavelength:     %d μm\n", wavelength_int);

    int flag_temp_int = (int)flag_temp_c;
    printf("  • Flag temp:      %d°C\n", flag_temp_int);

    // Radiance scale as fixed-point (×1000000)
    int radiance_int = (int)(radiance_scale * 1000000.0f);
    printf("  • Radiance scale: %d (×1e-6)\n", radiance_int);

    printf("  • Resolution:     0.01°C\n");
    printf("  • Output format:  (T × 100) + 10000\n");
    printf("\n");

    const float lambda = wavelength_um;
    const float lambda5 = powf(lambda, 5.0f);
    const float lambda_c2 = lambda * PLANCK_C2;

    uint32_t valid_count = 0;
    uint32_t saturated_count = 0;
    uint32_t zero_count = 0;

    printf("Generating 65536 entries...\n");

    for (uint32_t adc = 0; adc < 65536; adc++) {
        float radiance = (float)adc * radiance_scale;

        if (radiance <= 0.0f) {
            planck_table[adc] = 0;
            zero_count++;
            continue;
        }

        float ratio = PLANCK_C1 / (radiance * lambda5);

        if (ratio < 1e-6f) {
            planck_table[adc] = 65535;
            saturated_count++;
            continue;
        }

        float temp_kelvin = lambda_c2 / logf(ratio + 1.0f);
        float temp_celsius = temp_kelvin - 273.15f;
        float temp_relative = temp_celsius - flag_temp_c;
        int32_t temp_output = (int32_t)((temp_relative * TEMP_SCALE) + TEMP_OFFSET);

        if (temp_output < 0) {
            planck_table[adc] = 0;
            zero_count++;
        } else if (temp_output > 65535) {
            planck_table[adc] = 65535;
            saturated_count++;
        } else {
            planck_table[adc] = (uint16_t)temp_output;
            valid_count++;
        }
    }

    printf("✓ LUT generation complete!\n\n");

    printf("Statistics:\n");

    // Calculate percentage as integer (×10 for one decimal)
    uint32_t valid_pct = (valid_count * 1000) / 65536;  // ×10 for 1 decimal
    uint32_t zero_pct = (zero_count * 1000) / 65536;
    uint32_t sat_pct = (saturated_count * 1000) / 65536;

    printf("  • Valid entries:     %5lu (%lu.%lu%%)\n",
           valid_count, valid_pct / 10, valid_pct % 10);
    printf("  • Zero entries:      %5lu (%lu.%lu%%)\n",
           zero_count, zero_pct / 10, zero_pct % 10);
    printf("  • Saturated entries: %5lu (%lu.%lu%%)\n",
           saturated_count, sat_pct / 10, sat_pct % 10);
    printf("\n");

    printf("Sample LUT Values:\n");
    printf("  ADC      -> Output   -> Temperature\n");
    printf("  ────────────────────────────────────\n");

    uint32_t samples[] = {100, 1000, 5000, 10000, 20000, 30000, 40000, 50000};
    for (int i = 0; i < 8; i++) {
        uint32_t adc = samples[i];
        if (adc < 65536) {
            uint16_t output = planck_table[adc];

            // Decode temperature as integer (centidegrees)
            int32_t temp_centi = (int32_t)output - 10000;  // Can be negative!
            int32_t temp_abs = (temp_centi < 0) ? -temp_centi : temp_centi;
            char sign = (temp_centi < 0) ? '-' : '+';

            // Split into integer and fractional parts
            uint32_t temp_int = temp_abs / 100;
            uint32_t temp_frac = temp_abs % 100;

            printf("  %-8lu -> %-7u -> %c%lu.%02lu°C\n",
                   adc, output, sign, temp_int, temp_frac);
        }
    }

    printf("\n");
    printf("╔═══════════════════════════════════════════════╗\n");
    printf("║  Planck LUT Ready in DTCM!                    ║\n");
    printf("╚═══════════════════════════════════════════════╝\n");
    printf("\n");
}

/**
 * @brief Decode temperature - Integer version (no float printf needed!)
 * @param value: LUT output value
 * @param temp_int: Output integer part (degrees)
 * @param temp_frac: Output fractional part (0-99 centidegrees)
 * @param is_negative: Output sign flag
 */
void decode_temperature_int(uint16_t value,
                           uint32_t *temp_int,
                           uint32_t *temp_frac,
                           uint8_t *is_negative)
{
    int32_t temp_centi = (int32_t)value - 10000;

