ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
        vst1q_u16(dst + i, out);
    }

    for (; i < n; ++i) {
        uint32_t prod = (uint32_t)src[i] * (uint32_t)gain[i];
        uint32_t rounded = prod + (1u << (shift - 1));
        uint32_t shifted = rounded >> shift;
        int32_t result = (int32_t)shifted + (int32_t)offset;

        if (result < 0) result = 0;
        if (result > 65535) result = 65535;

        dst[i] = (uint16_t)result;
    }
}
void planck_lut_mve(const uint16_t *src, uint16_t *dst, int n)
{
    int i = 0;
    for (; i <= n - 8; i += 8)
    {
        uint16x8_t idx = vld1q_u16(src + i);
        uint16x8_t val = vldrhq_gather_shifted_offset_u16(planck_table, idx);
        vst1q_u16(dst + i, val);
    }
    for (; i < n; ++i) dst[i] = planck_table[src[i]];
}

/* USER CODE BEGIN 4 */
static inline void DWT_CycleCounter_Init(void)
{
    // Trace/DWT einschalten
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

    // Manche MCUs haben ein verriegeltes DWT -> via LAR unlocken
    #if defined(DWT_LAR)
    DWT->LAR = 0xC5ACCE55;   // <-- richtiges Register (nicht LSR)
    #endif

    DWT->CYCCNT = 0;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;
}

static inline void process_thermal_line_fastest(
    const uint16_t * __restrict__ sensor_data,
    const uint16_t * __restrict__ dark,
    const uint16_t * __restrict__ gain,
    const uint16_t * __restrict__ offset,
    const uint16_t * __restrict__ planck_lut,
    uint16_t * __restrict__ output,
    uint32_t width)
{
    for (uint32_t x = 0; x < width; x += 8)
    {
        // Load
        uint16x8_t adc = vld1q_u16(&sensor_data[x]);
        uint16x8_t dark_val = vld1q_u16(&dark[x]);
        uint16x8_t gain_val = vld1q_u16(&gain[x]);


        // Dark subtract
        uint16x8_t corrected = vqsubq_u16(adc, dark_val);

        // ⭐ Gain (Q15) - Reinterpret as signed, multiply, reinterpret back
        int16x8_t corrected_s = vreinterpretq_s16_u16(corrected);
        int16x8_t gain_s = vreinterpretq_s16_u16(gain_val);
        int16x8_t result_s = vqrdmulhq_s16(corrected_s, gain_s);
        uint16x8_t result = vreinterpretq_u16_s16(result_s);

        // Planck LUT
        result = vldrhq_gather_shifted_offset_u16(planck_lut, result);

        // Store
        vst1q_u16(&output[x], result);
    }
}

/* USER CODE END 4 */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_XSPI2_Init();
  /* USER CODE BEGIN 2 */
  /* USER CODE BEGIN 2 */

    // ═══════════════════════════════════════════════════════════════════
    // STM32N6 Thermal Imaging System - Production Code
    // 66 FPS Processing Pipeline (31 us/line)
    // ═══════════════════════════════════════════════════════════════════

    printf("\n");
    printf("╔════════════════════════════════════════════════╗\n");
    printf("║  STM32N6 Thermal Imaging System               ║\n");
    printf("║  Production Code - 66 FPS Pipeline            ║\n");
    printf("╚════════════════════════════════════════════════╝\n");
    printf("\n");


    init_planck_lut();

    // ────────────────────────────────────────────────────────────────────
    // Initialize XSPI Memory-Mapped Mode
    // ────────────────────────────────────────────────────────────────────
    printf("Initializing XSPI Memory-Mapped Mode...\n");

    XSPI_NOR_OctalDTRModeCfg(&hxspi2);

    // READ configuration
    XSPI_RegularCmdTypeDef sRead = {0};
    sRead.OperationType        = HAL_XSPI_OPTYPE_READ_CFG;
    sRead.Instruction          = OCTAL_IO_DTR_READ_CMD;
    sRead.InstructionMode      = HAL_XSPI_INSTRUCTION_8_LINES;
    sRead.InstructionWidth     = HAL_XSPI_INSTRUCTION_16_BITS;
    sRead.InstructionDTRMode   = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
    sRead.AddressMode          = HAL_XSPI_ADDRESS_8_LINES;
    sRead.AddressWidth         = HAL_XSPI_ADDRESS_32_BITS;
    sRead.AddressDTRMode       = HAL_XSPI_ADDRESS_DTR_ENABLE;
    sRead.DataMode             = HAL_XSPI_DATA_8_LINES;
    sRead.DataDTRMode          = HAL_XSPI_DATA_DTR_ENABLE;
    sRead.DummyCycles          = DUMMY_CLOCK_CYCLES_READ_OCTAL;
    sRead.DQSMode              = HAL_XSPI_DQS_ENABLE;
    sRead.AlternateBytesMode   = HAL_XSPI_ALT_BYTES_NONE;

    if (HAL_XSPI_Command(&hxspi2, &sRead, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        printf("✗ XSPI READ-CFG failed\n");
        Error_Handler();
    }

    // WRITE configuration
    XSPI_RegularCmdTypeDef sWrite = {0};
    sWrite.OperationType       = HAL_XSPI_OPTYPE_WRITE_CFG;
    sWrite.Instruction         = OCTAL_PAGE_PROG_CMD;
    sWrite.InstructionMode     = HAL_XSPI_INSTRUCTION_8_LINES;
    sWrite.InstructionWidth    = HAL_XSPI_INSTRUCTION_16_BITS;
    sWrite.InstructionDTRMode  = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
    sWrite.AddressMode         = HAL_XSPI_ADDRESS_8_LINES;
    sWrite.AddressWidth        = HAL_XSPI_ADDRESS_32_BITS;
    sWrite.AddressDTRMode      = HAL_XSPI_ADDRESS_DTR_ENABLE;
    sWrite.DataMode            = HAL_XSPI_DATA_8_LINES;
    sWrite.DataDTRMode         = HAL_XSPI_DATA_DTR_ENABLE;
    sWrite.DummyCycles         = 0;
    sWrite.DQSMode             = HAL_XSPI_DQS_DISABLE;
    sWrite.AlternateBytesMode  = HAL_XSPI_ALT_BYTES_NONE;

    if (HAL_XSPI_Command(&hxspi2, &sWrite, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        printf("✗ XSPI WRITE-CFG failed\n");
        Error_Handler();
    }

    // Enter Memory-Mapped mode
    XSPI_MemoryMappedTypeDef sMMAP = {0};
    sMMAP.TimeOutActivation  = HAL_XSPI_TIMEOUT_COUNTER_ENABLE;
    sMMAP.TimeoutPeriodClock = 0x50;

