ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
    if (HAL_XSPI_MemoryMapped(&hxspi2, &sMMAP) != HAL_OK) {
        printf("✗ XSPI Memory-Mapped failed\n");
        Error_Handler();
    }

    // Configure MPU for XSPI
    xspi_mmap_base = XSPI2_MMAP_BASE;
    uint32_t xspi_mmap_end = xspi_mmap_base + XSPI_MMAP_SIZE - 1;

    ARM_MPU_Region_t mpu_table[] = {
      {
        .RBAR = ARM_MPU_RBAR(xspi_mmap_base, ARM_MPU_SH_NON, 0, 1, 0),
        .RLAR = ARM_MPU_RLAR(xspi_mmap_end, 0)
      }
    };

    ARM_MPU_Disable();
    ARM_MPU_SetMemAttr(0, ARM_MPU_ATTR(
      ARM_MPU_ATTR_MEMORY_(1,0,1,0),  // Outer: WB/WA
      ARM_MPU_ATTR_MEMORY_(1,0,1,0)   // Inner: WB/WA
    ));
    ARM_MPU_Load(0, mpu_table, 1);
    ARM_MPU_Enable(MPU_CTRL_PRIVDEFENA_Msk);
    __DSB(); __ISB();

    printf("✓ XSPI Memory-Mapped Mode ready\n");

    // ────────────────────────────────────────────────────────────────────
    // Initialize Thermal Pipeline
    // ────────────────────────────────────────────────────────────────────
    printf("\nInitializing thermal pipeline...\n");

    // Initialize DWT cycle counter
    DWT_CycleCounter_Init();

    // Initialize Planck LUT (dummy for now)
    printf("  • Planck LUT...");
    for (uint32_t i = 0; i < 65536; i++) {
        planck_table[i] = (uint16_t)i;  // TODO: Real Planck function
    }
    printf(" ✓\n");

    // Initialize test data (dummy sensor frame)
    printf("  • Test pattern...");
    for (uint32_t y = 0; y < VPIX; y++) {
        for (uint32_t x = 0; x < HPIX; x++) {
            frame_buffer_A[y][x] = 8000 + (x % 100);  // Dummy ADC values
        }
    }
    printf(" ✓\n");

    // Initialize calibration data (dummy)
    printf("  • Calibration data...");
    for (uint32_t i = 0; i < HPIX; i++) {
        dark_line[i] = 100 + (i % 10);       // Dummy dark frame
        gain_line[i] = gain_to_q15(1.0f);    // Unity gain
        // offset in temp_line reused
    }
    printf(" ✓\n");

    // ────────────────────────────────────────────────────────────────────
    // Initialize 50 Hz Timer (VSYNC simulation)
    // ────────────────────────────────────────────────────────────────────
    printf("\nInitializing 50 Hz VSYNC timer...\n");
    thermal_vsync_init();
    thermal_vsync_start();

    printf("\n");
    printf("╔════════════════════════════════════════════════╗\n");
    printf("║  System Ready!                                 ║\n");
    printf("║  Processing @ 66 FPS (31 us/line)             ║\n");
    printf("║  LED toggle @ 66 Hz (visible on oscilloscope) ║\n");
    printf("╚════════════════════════════════════════════════╝\n");
    printf("\n");

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */

    //uint32_t frame_count = 0;
    //uint32_t last_perf_check = HAL_GetTick();
    static uint8_t led_state = 0;
    static int count = 0;
    while (1)
    {
      /* USER CODE END WHILE */

      /* USER CODE BEGIN 3 */

      DWT->CYCCNT = 0;
      //LED1_SET();
      // Process all lines with fastest pipeline
      for (int line = 0; line < VPIX; line++) {
          process_thermal_line_fastest(
              frame_buffer_A[line],    // Raw sensor (dummy)
              dark_line,               // Dark frame
              gain_line,               // Gain coefficients (Q15)
              temp_line,               // Offset (reused buffer)
              planck_table,            // Planck LUT
              frame_buffer_B[line],    // Output
              HPIX
          );
      }
      //LED1_RESET();

      uint32_t cycles = DWT->CYCCNT;
      if (++count >= 100) {
          printf("Frame time: %lu cycles (%lu ms)\n",
                 cycles, cycles / 600000);
          count = 0;
//          if(led_state) {
//			  LED1_RESET();
//			  led_state = 0;
//		  } else {
//			  LED1_SET();
//			  led_state = 1;
//		  }
      }
    }
    /* USER CODE END 3 */
  /* USER CODE END 3 */
}
/* USER CODE BEGIN CLK 1 */
/* USER CODE END CLK 1 */

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the System Power Supply
  */
  if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK)
  {
    Error_Handler();
  }

  /* Enable HSI */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Get current CPU/System buses clocks configuration and if necessary switch
 to intermediate HSI clock to ensure target clock can be set
  */
  HAL_RCC_GetClockConfig(&RCC_ClkInitStruct);
  if ((RCC_ClkInitStruct.CPUCLKSource == RCC_CPUCLKSOURCE_IC1) ||
     (RCC_ClkInitStruct.SYSCLKSource == RCC_SYSCLKSOURCE_IC2_IC6_IC11))
  {
    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_SYSCLK);
    RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_HSI;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK)
    {
      /* Initialization Error */
      Error_Handler();
    }
  }

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL1.PLLM = 4;
  RCC_OscInitStruct.PLL1.PLLN = 75;
  RCC_OscInitStruct.PLL1.PLLFractional = 0;
  RCC_OscInitStruct.PLL1.PLLP1 = 1;
  RCC_OscInitStruct.PLL1.PLLP2 = 1;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_CPUCLK|RCC_CLOCKTYPE_HCLK
                              |RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
                              |RCC_CLOCKTYPE_PCLK2|RCC_CLOCKTYPE_PCLK5
                              |RCC_CLOCKTYPE_PCLK4;
  RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_IC1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_IC2_IC6_IC11;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;
  RCC_ClkInitStruct.APB5CLKDivider = RCC_APB5_DIV1;
  RCC_ClkInitStruct.IC1Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC1Selection.ClockDivider = 2;
  RCC_ClkInitStruct.IC2Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC2Selection.ClockDivider = 3;
  RCC_ClkInitStruct.IC6Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC6Selection.ClockDivider = 4;
  RCC_ClkInitStruct.IC11Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC11Selection.ClockDivider = 3;

