ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart1.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetTxFifoThreshold(&huart1, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetRxFifoThreshold(&huart1, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_DisableFifoMode(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */

}

/**
  * @brief XSPI2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_XSPI2_Init(void)
{

  /* USER CODE BEGIN XSPI2_Init 0 */

  /* USER CODE END XSPI2_Init 0 */

  XSPIM_CfgTypeDef sXspiManagerCfg = {0};

  /* USER CODE BEGIN XSPI2_Init 1 */

  /* USER CODE END XSPI2_Init 1 */
  /* XSPI2 parameter configuration*/
  hxspi2.Instance = XSPI2;
  hxspi2.Init.FifoThresholdByte = 4;
  hxspi2.Init.MemoryMode = HAL_XSPI_SINGLE_MEM;
  hxspi2.Init.MemoryType = HAL_XSPI_MEMTYPE_MACRONIX;
  hxspi2.Init.MemorySize = HAL_XSPI_SIZE_512MB;
  hxspi2.Init.ChipSelectHighTimeCycle = 1;
  hxspi2.Init.FreeRunningClock = HAL_XSPI_FREERUNCLK_DISABLE;
  hxspi2.Init.ClockMode = HAL_XSPI_CLOCK_MODE_0;
  hxspi2.Init.WrapSize = HAL_XSPI_WRAP_NOT_SUPPORTED;
  hxspi2.Init.ClockPrescaler = 1;
  hxspi2.Init.SampleShifting = HAL_XSPI_SAMPLE_SHIFT_NONE;
  hxspi2.Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_ENABLE;
  hxspi2.Init.ChipSelectBoundary = HAL_XSPI_BONDARYOF_NONE;
  hxspi2.Init.MaxTran = 0;
  hxspi2.Init.Refresh = 0;
  hxspi2.Init.MemorySelect = HAL_XSPI_CSSEL_NCS1;
  if (HAL_XSPI_Init(&hxspi2) != HAL_OK)
  {
    Error_Handler();
  }
  sXspiManagerCfg.nCSOverride = HAL_XSPI_CSSEL_OVR_NCS1;
  sXspiManagerCfg.IOPort = HAL_XSPIM_IOPORT_2;
  sXspiManagerCfg.Req2AckTime = 1;
  if (HAL_XSPIM_Config(&hxspi2, &sXspiManagerCfg, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN XSPI2_Init 2 */

  /* USER CODE END XSPI2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOG_CLK_ENABLE();  // ✓ Correct for LED1 (PG8)

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : LED1_Pin */
  GPIO_InitStruct.Pin = LED1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(LED1_GPIO_Port, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
#if !defined(TERMINAL_IO)

#if defined(__ICCARM__)
size_t __write(int file, unsigned char const *ptr, size_t len)
{
    size_t idx;
    unsigned char const *pdata = ptr;

    for (idx = 0; idx < len; idx++)
    {
        iar_fputc((int)*pdata);
        pdata++;
    }
    return len;
}
#endif

PUTCHAR_PROTOTYPE
{
    HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, 0xFFFF);
    return ch;
}
#endif

///* === XSPI helpers (protected) ============================================ */
//static void XSPI_WriteEnable(XSPI_HandleTypeDef *hxspi)
//{
//  XSPI_RegularCmdTypeDef  sCommand = {0};
//  XSPI_AutoPollingTypeDef sConfig  = {0};
//
//  /* Enable write operations ------------------------------------------ */
//  sCommand.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
//  sCommand.Instruction        = OCTAL_WRITE_ENABLE_CMD;
//  sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
//  sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_16_BITS;
//  sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
//  sCommand.AddressMode        = HAL_XSPI_ADDRESS_NONE;
//  sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//  sCommand.DataMode           = HAL_XSPI_DATA_NONE;
//  sCommand.DummyCycles        = 0;
//  sCommand.DQSMode            = HAL_XSPI_DQS_DISABLE;
//
//  if (HAL_XSPI_Command(hxspi, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//  {
//    Error_Handler();
//  }
//
//  /* Configure automatic polling mode to wait for write enabling ---- */
//  sCommand.Instruction        = OCTAL_READ_STATUS_REG_CMD;
//  sCommand.Address            = 0x0;
//  sCommand.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
//  sCommand.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
//  sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
//  sCommand.DataMode           = HAL_XSPI_DATA_8_LINES;
//  sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
//  sCommand.DataLength         = 2;
//  sCommand.DummyCycles        = DUMMY_CLOCK_CYCLES_READ_OCTAL;
//  sCommand.DQSMode            = HAL_XSPI_DQS_ENABLE;
//
//  if (HAL_XSPI_Command(hxspi, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//  {
//    Error_Handler();
//  }
//
//  sConfig.MatchMode           = HAL_XSPI_MATCH_MODE_AND;
//  sConfig.AutomaticStop       = HAL_XSPI_AUTOMATIC_STOP_ENABLE;
//  sConfig.IntervalTime        = AUTO_POLLING_INTERVAL;
//  sConfig.MatchMask           = WRITE_ENABLE_MASK_VALUE;
//  sConfig.MatchValue          = WRITE_ENABLE_MATCH_VALUE;
//
//  if (HAL_XSPI_AutoPolling(hxspi, &sConfig, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//  {
//    Error_Handler();
//  }
//}

//static void XSPI_AutoPollingMemReady(XSPI_HandleTypeDef *hxspi)
//{
//  XSPI_RegularCmdTypeDef  sCommand = {0};
//  XSPI_AutoPollingTypeDef sConfig  = {0};
//
//  /* Configure automatic polling mode to wait for memory ready ------ */
//  sCommand.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
//  sCommand.Instruction        = OCTAL_READ_STATUS_REG_CMD;
//  sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
//  sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_16_BITS;
//  sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
//  sCommand.Address            = 0x0;
//  sCommand.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
//  sCommand.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
//  sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
//  sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//  sCommand.DataMode           = HAL_XSPI_DATA_8_LINES;
//  sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
//  sCommand.DataLength         = 2;
//  sCommand.DummyCycles        = DUMMY_CLOCK_CYCLES_READ_OCTAL;
//  sCommand.DQSMode            = HAL_XSPI_DQS_ENABLE;
//
//  if (HAL_XSPI_Command(hxspi, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//  {
//    Error_Handler();
//  }
//
//  sConfig.MatchMode           = HAL_XSPI_MATCH_MODE_AND;
//  sConfig.AutomaticStop       = HAL_XSPI_AUTOMATIC_STOP_ENABLE;
//  sConfig.IntervalTime        = AUTO_POLLING_INTERVAL;
//  sConfig.MatchMask           = MEMORY_READY_MASK_VALUE;
//  sConfig.MatchValue          = MEMORY_READY_MATCH_VALUE;
//
//  if (HAL_XSPI_AutoPolling(hxspi, &sConfig, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//  {
//    Error_Handler();
//  }
//}

/**
* @brief  This function configure the memory in Octal DTR mode.
* @param  hxspi: XSPI handle
* @retval None
*/
static void XSPI_NOR_OctalDTRModeCfg(XSPI_HandleTypeDef *hxspi)
{
  uint8_t reg = 0;
  XSPI_RegularCmdTypeDef  sCommand = {0};
  XSPI_AutoPollingTypeDef sConfig  = {0};

  sCommand.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_1_LINE;
  sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_8_BITS;
  sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
  sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_DISABLE;
  sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
  sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_DISABLE;
  sCommand.DummyCycles        = 0;
  sCommand.DQSMode            = HAL_XSPI_DQS_DISABLE;
  sConfig.MatchMode           = HAL_XSPI_MATCH_MODE_AND;
  sConfig.AutomaticStop       = HAL_XSPI_AUTOMATIC_STOP_ENABLE;
  sConfig.IntervalTime        = 0x10;

  /* Enable write operations */
  sCommand.Instruction = WRITE_ENABLE_CMD;
  sCommand.DataMode    = HAL_XSPI_DATA_NONE;
  sCommand.AddressMode = HAL_XSPI_ADDRESS_NONE;

  if (HAL_XSPI_Command(hxspi, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

